In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv('StudentsPerformance.csv')
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

##Find out how many males and females participated in the test

In [6]:
df['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

In [ ]:
## What do you think about the students' parental level of education?

In [47]:
data=df['parental level of education'].value_counts()
data

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [ ]:
Observation:-5% parents have master degree and more than 60% parents educated above high school level

In [54]:
 ## Who scores the most on average for math, reading and writing based on

In [34]:
Score_Gender=df.groupby('gender')[['math score','reading score','writing score']].mean().round(2)
Score_Gender

        math score  reading score  writing score
gender
female       63.38          72.59          72.47
male         68.82          65.55          63.45

In [ ]:
Observation:-Girls performed well in all three categories

In [32]:
test_prep=df.groupby('test preparation course')[['math score','reading score','writing score']].mean().round(2)
test_prep

                         math score  reading score  writing score
test preparation course
completed                     69.97          74.18          74.68
none                          63.79          66.42          64.46

In [ ]:
Observation:-From data it is evident that those prepared for test done better

In [35]:
Score_Gender=df.groupby('gender')[['math score','reading score','writing score']].std().round(2)
Score_Gender

        math score  reading score  writing score
gender
female       16.03          14.41          14.84
male         14.56          14.15          14.23

In [ ]:
Observation:-in Math score variance is  high among female student , in all other category its almost same

In [36]:
test_prep=df.groupby('test preparation course')[['math score','reading score','writing score']].std().round(2)
test_prep

                         math score  reading score  writing score
test preparation course
completed                     14.52          13.54          13.24
none                          15.71          14.61          15.04

In [ ]:
Observation:-Variation among none prepared for test is high as compare to other groupn

In [ ]:
 ##The management needs your help to give bonus points to the top 25% of students based on their maths score, so how will you help the management to achieve this.

In [37]:
q75 = df['math score'].quantile(q=0.75)
q75

77.0

In [ ]:
Observation:-students scored above 77 can be considered for scholarship